//Autogen by dataconv.py on 2021-09-27 11:13:33.158759
var EVENTS = {
	[2] : {
		"描述" : "这一层什么也没有",
	},
	[3] : {
		"描述" : "你捡到了一元钱",
		"金钱" : 1.0,
	},
	[4] : {
		"描述" : "你捡到了10块钱",
		"金钱" : 10.0,
	},
	[5] : {
		"描述" : "你发现了一些罐装食物",
		"食物" : 5.0,
	},
	[6] : {
		"描述" : "你休息了片刻，回复了1点生命值",
		"体力" : 1.0,
	},
	[7] : {
		"描述" : "你不小心触发了古墓内遗留下来的机关",
		"好结果" : 8.0,
		"坏结果" : 9.0,
	},
	[8] : {
		"描述" : "幸运的是，机关已经非常陈旧了，所以并没有任何作用",
		"依赖" : 7,
	},
	[9] : {
		"描述" : "你被机关伤到！",
		"依赖" : 7,
		"体力" : -10.0,
	},
	[10] : {
		"描述" : "你来到了一个祭坛，这里供奉着古代神明，你可以向神明祈祷：",
		"选项" : "11, 12, 13, 14",
	},
	[11] : {
		"名称" : "祈求平安",
		"描述" : "你祈求平安，你的体力上限提升了！",
		"依赖" : 10,
		"体力上限" : 10.0,
	},
	[12] : {
		"名称" : "祈求富贵",
		"描述" : "你祈求富贵，你获得了一些金币！",
		"依赖" : 10,
		"金钱" : 50.0,
	},
	[13] : {
		"名称" : "祈求好运",
		"描述" : "你祈求好运，你的运气增加了！",
		"依赖" : 10,
		"运气" : 10.0,
	},
	[14] : {
		"名称" : "离开",
		"描述" : "你选择了离开，什么事情也没有发生",
		"依赖" : 10,
	},
	[15] : {
		"描述" : "你发现了一些生长在遗迹内的野生蘑菇，是否要尝尝看？",
		"选项" : "16, 19",
		"天赋选项" : "20#46, 21#29, 21#33, 22#9",
	},
	[16] : {
		"名称" : "品尝",
		"描述" : "你采了一颗蘑菇尝了尝",
		"依赖" : 14,
		"好结果" : 17.0,
		"坏结果" : 18.0,
	},
	[17] : {
		"描述" : "蘑菇没有任何问题，而且味道非常鲜美。于是你又多采了一些，方便之后食用",
		"依赖" : 16,
		"食物" : 5.0,
	},
	[18] : {
		"描述" : "你吃完蘑菇后顿时感觉头晕目眩，你中毒了！",
		"依赖" : 16,
		"中毒时间" : 5.0,
		"中毒效果" : 5.0,
	},
	[19] : {
		"名称" : "不尝",
		"描述" : "你觉得这些野生蘑菇不靠谱，于是就没有再碰它们",
		"依赖" : 14,
	},
	[20] : {
		"名称" : "带走",
		"描述" : "你百毒不侵，毒蘑菇对你来说也是食物，于是你把蘑菇都采了带到路上吃",
		"依赖" : 14,
		"食物" : 8.0,
	},
	[21] : {
		"名称" : "挑选",
		"描述" : "你经常食用各种类型的蘑菇，所以对蘑菇非常了解。你挑选出了那些没有毒的蘑菇作为储备食物。",
		"依赖" : 14,
		"食物" : 5.0,
	},
	[22] : {
		"名称" : "加工",
		"描述" : "你是炊事部长，所以你很清楚如何挑选与加工野生蘑菇。你挑选出了一些合适的蘑菇并加工成了美食。",
		"依赖" : 14,
		"食物" : 7.0,
	},
	[23] : {
		"描述" : "你遇到了遗迹的守卫者前哨，是否要与其战斗？",
		"选项" : "24, 25",
	},
	[24] : {
		"名称" : "战斗",
		"描述" : "你选择和守卫者前哨战斗！",
		"依赖" : 23,
		"好结果" : 28.0,
		"坏结果" : 28.0,
		"敌人战力" : 125.0,
	},
	[25] : {
		"名称" : "逃跑",
		"描述" : "你选择逃跑！",
		"依赖" : 23,
		"好结果" : 26.0,
		"坏结果" : 27.0,
	},
	[26] : {
		"描述" : "你成功逃脱！",
		"依赖" : 25,
	},
	[27] : {
		"描述" : "你没能成功逃脱，被迫和守卫者前哨战斗！",
		"依赖" : 25,
		"好结果" : 28.0,
		"坏结果" : 28.0,
		"敌人战力" : 125.0,
	},
	[28] : {
		"描述" : "你战胜了守卫者前哨，在它的身上搜刮到了一些金币！",
		"依赖" : "24, 27",
		"金钱" : 5.0,
	},
	[29] : {
		"描述" : "你遇到了遗迹的守卫者盾卫，是否要与其战斗？",
		"选项" : "30, 31",
	},
	[30] : {
		"名称" : "战斗",
		"描述" : "你选择和守卫者盾卫战斗！",
		"依赖" : 29,
		"好结果" : 32.0,
		"坏结果" : 32.0,
		"敌人战力" : 120.0,
	},
	[31] : {
		"名称" : "逃跑",
		"描述" : "守卫者盾卫行动缓慢，你轻松逃脱！",
		"依赖" : 29,
	},
	[32] : {
		"描述" : "你继续和守卫者盾卫战斗！",
		"依赖" : 30,
		"好结果" : 33.0,
		"坏结果" : 33.0,
		"敌人战力" : 120.0,
	},
	[33] : {
		"描述" : "你继续和守卫者盾卫战斗！",
		"依赖" : 32,
		"好结果" : 34.0,
		"坏结果" : 34.0,
		"敌人战力" : 120.0,
	},
	[34] : {
		"描述" : "你战胜了守卫者盾卫，在它的身上搜刮到了一些金币！",
		"依赖" : 33,
		"金钱" : 8.0,
	},
}